{
  "word2idx": {
    "switch": 0,
    "large": 1,
    "it": 2,
    "cleanser": 3,
    "see": 4,
    "triggered": 5,
    "days": 6,
    "weeks": 7,
    "long": 8,
    "There": 9,
    "has": 10,
    "no": 11,
    "appears": 12,
    "spray": 13,
    "pain": 14,
    "using": 15,
    "weather": 16,
    "regularly": 17,
    "elbows": 18,
    "hours": 19,
    "use": 20,
    "legs": 21,
    "notice": 22,
    "humid": 23,
    "of": 24,
    "for": 25,
    "step": 26,
    "been": 27,
    "hour": 28,
    "spreads": 29,
    "chest": 30,
    "tiny": 31,
    "sunny": 32,
    "mask": 33,
    "painful": 34,
    "stress": 35,
    "how": 36,
    "get": 37,
    "breaking": 38,
    "during": 39,
    "blackheads": 40,
    "redness": 41,
    "in": 42,
    "become": 43,
    "red": 44,
    "Dry": 45,
    "under": 46,
    "areas": 47,
    "contains": 48,
    "patches": 49,
    "since": 50,
    "won't": 51,
    "worse": 52,
    "perfume": 53,
    "each": 54,
    "away": 55,
    "perfumed": 56,
    "being": 57,
    "frequently": 58,
    "eyelids": 59,
    "develop": 60,
    "due": 61,
    "showers": 62,
    "severe": 63,
    "period": 64,
    "thick": 65,
    "eyes": 66,
    "tends": 67,
    "all": 68,
    "keep": 69,
    "sensation": 70,
    "from": 71,
    "zits": 72,
    "strong": 73,
    "forearms": 74,
    "cheeks": 75,
    "sleep": 76,
    "incredibly": 77,
    "high": 78,
    "certain": 79,
    "out": 80,
    "feel": 81,
    "because": 82,
    "season": 83,
    "The": 84,
    "irritated": 85,
    "fading": 86,
    "Do": 87,
    "happen": 88,
    "cycle": 89,
    "medication": 90,
    "facial": 91,
    "after": 92,
    "returns": 93,
    "deveolped": 94,
    "wear": 95,
    "flare": 96,
    "often": 97,
    "constantly": 98,
    "heal": 99,
    "cracked": 100,
    "laundry": 101,
    "sting": 102,
    "dealing": 103,
    "working": 104,
    "is": 105,
    "seem": 106,
    "very": 107,
    "happens": 108,
    "humidity": 109,
    "extreme": 110,
    "develops": 111,
    "cheek": 112,
    "rough": 113,
    "started": 114,
    "several": 115,
    "old": 116,
    "tingling": 117,
    "peel": 118,
    "burn": 119,
    "itch": 120,
    "heals": 121,
    "ears": 122,
    "reacts": 123,
    "whenever": 124,
    "appear": 125,
    "recently": 126,
    "easily": 127,
    "like": 128,
    "below": 129,
    "eat": 130,
    "have": 131,
    "feet": 132,
    "oilier": 133,
    "behind": 134,
    "chapped": 135,
    "wind": 136,
    "sun": 137,
    "can": 138,
    "fast": 139,
    "within": 140,
    "cream": 141,
    "had": 142,
    "left": 143,
    "feeling": 144,
    "july": 145,
    "my": 146,
    "late": 147,
    "suffer": 148,
    "again": 149,
    "scented": 150,
    "to": 151,
    "straight": 152,
    "what": 153,
    "stings": 154,
    "I": 155,
    "are": 156,
    "dry": 157,
    "experienced": 158,
    "be": 159,
    "food": 160,
    "extra": 161,
    "month": 162,
    "rashes": 163,
    "lips": 164,
    "soap": 165,
    "every": 166,
    "on": 167,
    "outside": 168,
    "chin": 169,
    "contact": 170,
    "experience": 171,
    "spicy": 172,
    "struggling": 173,
    "blot": 174,
    "exposure": 175,
    "can't": 176,
    "mild": 177,
    "you": 178,
    "hurt": 179,
    "itchy": 180,
    "starts": 181,
    "cosmetics": 182,
    "scarring": 183,
    "summers": 184,
    "seasons": 185,
    "itchness": 186,
    "exposed": 187,
    "take": 188,
    "swimming": 189,
    "comes": 190,
    "switching": 191,
    "sudden": 192,
    "sharp": 193,
    "spend": 194,
    "allergy": 195,
    "the": 196,
    "summer": 197,
    "night": 198,
    "skincare": 199,
    "autumn": 200,
    "especially": 201,
    "shinier": 202,
    "peeling": 203,
    "by": 204,
    "new": 205,
    "small": 206,
    "flakiness": 207,
    "think": 208,
    "lashes": 209,
    "eye": 210,
    "skin": 211,
    "time": 212,
    "texture": 213,
    "pores": 214,
    "continuous": 215,
    "sunscreen": 216,
    "eczema": 217,
    "midday": 218,
    "becomes": 219,
    "itiching": 220,
    "flaky": 221,
    "bumpy": 222,
    "help": 223,
    "workouts": 224,
    "heat": 225,
    "throughout": 226,
    "burning": 227,
    "extremely": 228,
    "appearing": 229,
    "this": 230,
    "became": 231,
    "usually": 232,
    "toner": 233,
    "up": 234,
    "likely": 235,
    "hands": 236,
    "worsens": 237,
    "an": 238,
    "getting": 239,
    "oiliness": 240,
    "itching": 241,
    "brittle": 242,
    "moisturizer": 243,
    "shower": 244,
    "flare-ups": 245,
    "with": 246,
    "tight": 247,
    "months": 248,
    "when": 249,
    "temples": 250,
    "arms": 251,
    "marks": 252,
    "wearing": 253,
    "serum": 254,
    "persistent": 255,
    "gets": 256,
    "T-zone": 257,
    "apply": 258,
    "other": 259,
    "prone": 260,
    "oily": 261,
    "noticed": 262,
    "as": 263,
    "and": 264,
    "continues": 265,
    "itchiness": 266,
    "constant": 267,
    "fade": 268,
    "temperature": 269,
    "whiteheads": 270,
    "fragrance": 271,
    "breakouts": 272,
    "any": 273,
    "eating": 274,
    "dryness": 275,
    "uneven": 276,
    "make": 277,
    "fragranced": 278,
    "products": 279,
    "stop": 280,
    "bad": 281,
    "scalp": 282,
    "matter": 283,
    "spreading": 284,
    "lasted": 285,
    "two": 286,
    "dark": 287,
    "am": 288,
    "heavy": 289,
    "fragrances": 290,
    "around": 291,
    "forehead": 292,
    "makes": 293,
    "foam": 294,
    "cleansing": 295,
    "taking": 296,
    "washing": 297,
    "shoulders": 298,
    "flares": 299,
    "experiencing": 300,
    "cleaning": 301,
    "would": 302,
    "lot": 303,
    "daily": 304,
    "more": 305,
    "combination": 306,
    "change": 307,
    "few": 308,
    "nose": 309,
    "sunscreens": 310,
    "winter": 311,
    "scratching": 312,
    "heater": 313,
    "near": 314,
    "crack": 315,
    "got": 316,
    "production": 317,
    "it's": 318,
    "Is": 319,
    "moderate": 320,
    "product": 321,
    "exercise": 322,
    "acne": 323,
    "body": 324,
    "forming": 325,
    "go": 326,
    "greasy": 327,
    "hot": 328,
    "than": 329,
    "spots": 330,
    "despite": 331,
    "too": 332,
    "appeared": 333,
    "After": 334,
    "lotions": 335,
    "shiny": 336,
    "makeup": 337,
    "face": 338,
    "Redness": 339,
    "start": 340,
    "sweating": 341,
    "drier": 342,
    "trying": 343,
    "rash": 344,
    "increases": 345,
    "slowly": 346,
    "wash": 347,
    "scarf": 348,
    "oil": 349,
    "pimples": 350,
    "both": 351,
    "showering": 352,
    "three": 353,
    "stays": 354,
    "swelling": 355,
    "air": 356,
    "goes": 357,
    "persisted": 358,
    "drops": 359,
    "turns": 360,
    "last": 361,
    "less": 362,
    "bumps": 363,
    "breaks": 364,
    "lasts": 365,
    "deals": 366,
    "much": 367,
    "reacting": 368,
    "feels": 369,
    "reduce": 370,
    "I've": 371,
    "neck": 372,
    "at": 373,
    "applying": 374,
    "that": 375,
    "area": 376,
    "know": 377,
    "burns": 378,
    "My": 379,
    "handwashing": 380,
    "times": 381,
    "cold": 382,
    "day": 383,
    "stressed": 384,
    "a": 385,
    "jawline": 386,
    "back": 387,
    "week": 388,
    "sensitive": 389,
    "really": 390,
    "detergent": 391,
    "travel": 392,
    "white": 393,
    "leaving": 394,
    "lotion": 395,
    "frequent": 396,
    "developed": 397,
    "even": 398,
    "PAD": 399,
    "UNK": 400
  },
  "tag2idx": {
    "I-TRIGGER": 0,
    "B-TRIGGER": 1,
    "B-DURATION": 2,
    "I-SKIN_TYPE": 3,
    "O": 4,
    "B-SYMPTOM": 5,
    "B-BODY_PART": 6,
    "B-SKIN_TYPE": 7,
    "I-DURATION": 8,
    "I-SEASON": 9,
    "B-SEASON": 10,
    "B-SEVERITY": 11,
    "I-SENSITIVITY": 12,
    "B-SENSITIVITY": 13,
    "I-SYMPTOM": 14
  },
  "idx2tag": {
    "0": "I-TRIGGER",
    "1": "B-TRIGGER",
    "2": "B-DURATION",
    "3": "I-SKIN_TYPE",
    "4": "O",
    "5": "B-SYMPTOM",
    "6": "B-BODY_PART",
    "7": "B-SKIN_TYPE",
    "8": "I-DURATION",
    "9": "I-SEASON",
    "10": "B-SEASON",
    "11": "B-SEVERITY",
    "12": "I-SENSITIVITY",
    "13": "B-SENSITIVITY",
    "14": "I-SYMPTOM"
  },
  "idx2word": {
    "0": "switch",
    "1": "large",
    "2": "it",
    "3": "cleanser",
    "4": "see",
    "5": "triggered",
    "6": "days",
    "7": "weeks",
    "8": "long",
    "9": "There",
    "10": "has",
    "11": "no",
    "12": "appears",
    "13": "spray",
    "14": "pain",
    "15": "using",
    "16": "weather",
    "17": "regularly",
    "18": "elbows",
    "19": "hours",
    "20": "use",
    "21": "legs",
    "22": "notice",
    "23": "humid",
    "24": "of",
    "25": "for",
    "26": "step",
    "27": "been",
    "28": "hour",
    "29": "spreads",
    "30": "chest",
    "31": "tiny",
    "32": "sunny",
    "33": "mask",
    "34": "painful",
    "35": "stress",
    "36": "how",
    "37": "get",
    "38": "breaking",
    "39": "during",
    "40": "blackheads",
    "41": "redness",
    "42": "in",
    "43": "become",
    "44": "red",
    "45": "Dry",
    "46": "under",
    "47": "areas",
    "48": "contains",
    "49": "patches",
    "50": "since",
    "51": "won't",
    "52": "worse",
    "53": "perfume",
    "54": "each",
    "55": "away",
    "56": "perfumed",
    "57": "being",
    "58": "frequently",
    "59": "eyelids",
    "60": "develop",
    "61": "due",
    "62": "showers",
    "63": "severe",
    "64": "period",
    "65": "thick",
    "66": "eyes",
    "67": "tends",
    "68": "all",
    "69": "keep",
    "70": "sensation",
    "71": "from",
    "72": "zits",
    "73": "strong",
    "74": "forearms",
    "75": "cheeks",
    "76": "sleep",
    "77": "incredibly",
    "78": "high",
    "79": "certain",
    "80": "out",
    "81": "feel",
    "82": "because",
    "83": "season",
    "84": "The",
    "85": "irritated",
    "86": "fading",
    "87": "Do",
    "88": "happen",
    "89": "cycle",
    "90": "medication",
    "91": "facial",
    "92": "after",
    "93": "returns",
    "94": "deveolped",
    "95": "wear",
    "96": "flare",
    "97": "often",
    "98": "constantly",
    "99": "heal",
    "100": "cracked",
    "101": "laundry",
    "102": "sting",
    "103": "dealing",
    "104": "working",
    "105": "is",
    "106": "seem",
    "107": "very",
    "108": "happens",
    "109": "humidity",
    "110": "extreme",
    "111": "develops",
    "112": "cheek",
    "113": "rough",
    "114": "started",
    "115": "several",
    "116": "old",
    "117": "tingling",
    "118": "peel",
    "119": "burn",
    "120": "itch",
    "121": "heals",
    "122": "ears",
    "123": "reacts",
    "124": "whenever",
    "125": "appear",
    "126": "recently",
    "127": "easily",
    "128": "like",
    "129": "below",
    "130": "eat",
    "131": "have",
    "132": "feet",
    "133": "oilier",
    "134": "behind",
    "135": "chapped",
    "136": "wind",
    "137": "sun",
    "138": "can",
    "139": "fast",
    "140": "within",
    "141": "cream",
    "142": "had",
    "143": "left",
    "144": "feeling",
    "145": "july",
    "146": "my",
    "147": "late",
    "148": "suffer",
    "149": "again",
    "150": "scented",
    "151": "to",
    "152": "straight",
    "153": "what",
    "154": "stings",
    "155": "I",
    "156": "are",
    "157": "dry",
    "158": "experienced",
    "159": "be",
    "160": "food",
    "161": "extra",
    "162": "month",
    "163": "rashes",
    "164": "lips",
    "165": "soap",
    "166": "every",
    "167": "on",
    "168": "outside",
    "169": "chin",
    "170": "contact",
    "171": "experience",
    "172": "spicy",
    "173": "struggling",
    "174": "blot",
    "175": "exposure",
    "176": "can't",
    "177": "mild",
    "178": "you",
    "179": "hurt",
    "180": "itchy",
    "181": "starts",
    "182": "cosmetics",
    "183": "scarring",
    "184": "summers",
    "185": "seasons",
    "186": "itchness",
    "187": "exposed",
    "188": "take",
    "189": "swimming",
    "190": "comes",
    "191": "switching",
    "192": "sudden",
    "193": "sharp",
    "194": "spend",
    "195": "allergy",
    "196": "the",
    "197": "summer",
    "198": "night",
    "199": "skincare",
    "200": "autumn",
    "201": "especially",
    "202": "shinier",
    "203": "peeling",
    "204": "by",
    "205": "new",
    "206": "small",
    "207": "flakiness",
    "208": "think",
    "209": "lashes",
    "210": "eye",
    "211": "skin",
    "212": "time",
    "213": "texture",
    "214": "pores",
    "215": "continuous",
    "216": "sunscreen",
    "217": "eczema",
    "218": "midday",
    "219": "becomes",
    "220": "itiching",
    "221": "flaky",
    "222": "bumpy",
    "223": "help",
    "224": "workouts",
    "225": "heat",
    "226": "throughout",
    "227": "burning",
    "228": "extremely",
    "229": "appearing",
    "230": "this",
    "231": "became",
    "232": "usually",
    "233": "toner",
    "234": "up",
    "235": "likely",
    "236": "hands",
    "237": "worsens",
    "238": "an",
    "239": "getting",
    "240": "oiliness",
    "241": "itching",
    "242": "brittle",
    "243": "moisturizer",
    "244": "shower",
    "245": "flare-ups",
    "246": "with",
    "247": "tight",
    "248": "months",
    "249": "when",
    "250": "temples",
    "251": "arms",
    "252": "marks",
    "253": "wearing",
    "254": "serum",
    "255": "persistent",
    "256": "gets",
    "257": "T-zone",
    "258": "apply",
    "259": "other",
    "260": "prone",
    "261": "oily",
    "262": "noticed",
    "263": "as",
    "264": "and",
    "265": "continues",
    "266": "itchiness",
    "267": "constant",
    "268": "fade",
    "269": "temperature",
    "270": "whiteheads",
    "271": "fragrance",
    "272": "breakouts",
    "273": "any",
    "274": "eating",
    "275": "dryness",
    "276": "uneven",
    "277": "make",
    "278": "fragranced",
    "279": "products",
    "280": "stop",
    "281": "bad",
    "282": "scalp",
    "283": "matter",
    "284": "spreading",
    "285": "lasted",
    "286": "two",
    "287": "dark",
    "288": "am",
    "289": "heavy",
    "290": "fragrances",
    "291": "around",
    "292": "forehead",
    "293": "makes",
    "294": "foam",
    "295": "cleansing",
    "296": "taking",
    "297": "washing",
    "298": "shoulders",
    "299": "flares",
    "300": "experiencing",
    "301": "cleaning",
    "302": "would",
    "303": "lot",
    "304": "daily",
    "305": "more",
    "306": "combination",
    "307": "change",
    "308": "few",
    "309": "nose",
    "310": "sunscreens",
    "311": "winter",
    "312": "scratching",
    "313": "heater",
    "314": "near",
    "315": "crack",
    "316": "got",
    "317": "production",
    "318": "it's",
    "319": "Is",
    "320": "moderate",
    "321": "product",
    "322": "exercise",
    "323": "acne",
    "324": "body",
    "325": "forming",
    "326": "go",
    "327": "greasy",
    "328": "hot",
    "329": "than",
    "330": "spots",
    "331": "despite",
    "332": "too",
    "333": "appeared",
    "334": "After",
    "335": "lotions",
    "336": "shiny",
    "337": "makeup",
    "338": "face",
    "339": "Redness",
    "340": "start",
    "341": "sweating",
    "342": "drier",
    "343": "trying",
    "344": "rash",
    "345": "increases",
    "346": "slowly",
    "347": "wash",
    "348": "scarf",
    "349": "oil",
    "350": "pimples",
    "351": "both",
    "352": "showering",
    "353": "three",
    "354": "stays",
    "355": "swelling",
    "356": "air",
    "357": "goes",
    "358": "persisted",
    "359": "drops",
    "360": "turns",
    "361": "last",
    "362": "less",
    "363": "bumps",
    "364": "breaks",
    "365": "lasts",
    "366": "deals",
    "367": "much",
    "368": "reacting",
    "369": "feels",
    "370": "reduce",
    "371": "I've",
    "372": "neck",
    "373": "at",
    "374": "applying",
    "375": "that",
    "376": "area",
    "377": "know",
    "378": "burns",
    "379": "My",
    "380": "handwashing",
    "381": "times",
    "382": "cold",
    "383": "day",
    "384": "stressed",
    "385": "a",
    "386": "jawline",
    "387": "back",
    "388": "week",
    "389": "sensitive",
    "390": "really",
    "391": "detergent",
    "392": "travel",
    "393": "white",
    "394": "leaving",
    "395": "lotion",
    "396": "frequent",
    "397": "developed",
    "398": "even",
    "399": "PAD",
    "400": "UNK"
  }
}